clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_fuart.c
/**
 *******************************************************************************
 * @file    tmpm36b_fuart.c
 * @brief   This file provides API functions for Full UART driver.
 * @version V2.0.2.4
 * @date    2014/05/20
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2014 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm36b_fuart.h"

#if defined(__TMPM36B_FUART_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup FUART
  * @brief FUART driver modules
  * @{
  */

/** @defgroup FUART_Private_Defines
  * @{
  */
#define CR_UARTEN_SET                          ((uint32_t)0x00000001)
#define CR_UARTEN_CLEAR                        ((uint32_t)0xFFFFFF7E)
#define CR_WRITE0_BIT_MASK                     ((uint32_t)0xFFFFFF7F)

#define RSR_ERROR_MASK                         ((uint32_t)0x0000000F)
#define RSR_FERR_FLAG                          ((uint32_t)0x00000001)
#define RSR_PERR_FLAG                          ((uint32_t)0x00000002)
#define RSR_BERR_FLAG                          ((uint32_t)0x00000004)
#define RSR_OERR_FLAG                          ((uint32_t)0x00000008)

#define ECR_ERROR_CLEAR                        ((uint32_t)0x00000000)

#define FR_BUSY_FLAG                           ((uint32_t)0x00000008)

#define LCR_H_FIFO_EN_FLAG                     ((uint32_t)0x00000010)
#define LCR_H_FIFO_EN_SET                      ((uint32_t)0x00000010)
#define LCR_H_FIFO_EN_CLEAR                    ((uint32_t)0xFFFFFFEF)
#define FR_TX_STORAGE_MASK                     ((uint32_t)0x000000A0)
#define FR_RX_STORAGE_MASK                     ((uint32_t)0x00000050)

#define FR_TX_STORAGE_NORMAL                   ((uint32_t)0x00000000)
#define FR_TX_STORAGE_FULL                     ((uint32_t)0x00000020)
#define FR_TX_STORAGE_EMPTY                    ((uint32_t)0x00000080)
#define FR_TX_STORAGE_INVALID                  ((uint32_t)0x000000A0)

#define FR_RX_STORAGE_NORMAL                   ((uint32_t)0x00000000)
#define FR_RX_STORAGE_EMPTY                    ((uint32_t)0x00000010)
#define FR_RX_STORAGE_FULL                     ((uint32_t)0x00000040)
#define FR_RX_STORAGE_INVALID                  ((uint32_t)0x00000050)

#define LCR_H_WLEN_MASK                        ((uint32_t)0xFFFFFF9F)
#define LCR_H_STP2_MASK                        ((uint32_t)0xFFFFFFF7)
#define LCR_H_PARITY_MASK                      ((uint32_t)0xFFFFFF79)
#define CR_FLOW_CTRL_MASK                      ((uint32_t)0x00000F00)
#define CR_MODE_MASK                           ((uint32_t)0x0000CC00)

#define LCR_H_BRK_SET                          ((uint32_t)0x00000001)
#define LCR_H_BRK_CLEAR                        ((uint32_t)0xFFFFFFFE)

#define CR_SIRLP_MASK                          ((uint32_t)0xFFFFFFFB)

#define CR_UARTEN_MASK                         ((uint32_t)0x00000001)
#define CR_SIREN_SET                           ((uint32_t)0x00000002)
#define CR_SIREN_CLEAR                         ((uint32_t)0xFFFFFFFD)

#define FUART_INT_BITS                         ((uint32_t)0x000007FF)

#define DMACR_DMAONERR_CLEAR                   ((uint32_t)0x00000003)
#define DMACR_DMAONERR_SET                     ((uint32_t)0x00000004)

#define DMACR_TXDMAE_CLEAR                     ((uint32_t)0x00000005)
#define DMACR_TXDMAE_SET                       ((uint32_t)0x00000002)
#define DMACR_RXDMAE_CLEAR                     ((uint32_t)0x00000006)
#define DMACR_RXDMAE_SET                       ((uint32_t)0x00000001)

#define FR_MODEM_STATUS_MASK                   ((uint32_t)0x00000107)
#define CR_MODEM_STATUS_MASK                   ((uint32_t)0x00000C00)

#define CR_RTS_OUTPUT_0                        ((uint32_t)0x00000800)
#define CR_RTS_OUTPUT_1                        ((uint32_t)0xFFFFF77F)

#define CR_DTR_OUTPUT_0                        ((uint32_t)0x00000400)
#define CR_DTR_OUTPUT_1                        ((uint32_t)0xFFFFFB7F)

/** @} */
/* End of group FUART_Private_Defines */

/** @defgroup FUART_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group FUART_Private_FunctionPrototypes */

/** @defgroup FUART_Private_Functions
  * @{
  */

/** @} */
/* End of group FUART_Private_Functions */

/** @defgroup FUART_Exported_Functions
  * @{
  */

/**
  * @brief  Enable the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_Enable(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    tmp = FUARTx->CR | CR_UARTEN_SET;
    tmp &= CR_WRITE0_BIT_MASK;
    FUARTx->CR = tmp;
}

/**
  * @brief  Disable the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_Disable(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    FUARTx->CR &= CR_UARTEN_CLEAR;
}

/**
  * @brief  Get received data from the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval The data received from FUARTx
  */
uint32_t FUART_GetRxData(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Return received data */
    retval = FUARTx->DR & 0xFFU;

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Data: The data to be sent.
  *   The Data range is 0x00 to 0xFF.
  * @retval None
  */
void FUART_SetTxData(TSB_FUART_TypeDef * FUARTx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DATA(Data));

