clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_fuart.c
    /* Get UARTCR<UARTEN> to check if Full UART channel is enabled */
    tmp = FUARTx->CR & CR_UARTEN_MASK;

    if (tmp == CR_UARTEN_SET) { /* Full UART is enabled */
        tmp = FUARTx->CR & CR_SIREN_CLEAR;
        tmp &= CR_WRITE0_BIT_MASK;      /* UARTCR bit 7 write as zero */
        FUARTx->CR = tmp;
    } else {                    /* Full UART is disabled */
        /* Do nothing */
    }
}

/**
  * @brief  Set the Receive and Transmit interrupt FIFO level.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  RxLevel: Receive interrupt FIFO level.
  *   This parameter can be one of the following values:
  *   FUART_RX_FIFO_LEVEL_4:  The data in Receive FIFO become >= 4 words
  *   FUART_RX_FIFO_LEVEL_8:  The data in Receive FIFO become >= 8 words
  *   FUART_RX_FIFO_LEVEL_16: The data in Receive FIFO become >= 16 words
  *   FUART_RX_FIFO_LEVEL_24: The data in Receive FIFO become >= 24 words
  *   FUART_RX_FIFO_LEVEL_28: The data in Receive FIFO become >= 28 words
  * @param  TxLevel: Transmit interrupt FIFO level.
  *   This parameter can be one of the following values:
  *   FUART_TX_FIFO_LEVEL_4:  The data in Transmit FIFO become <= 4 words
  *   FUART_TX_FIFO_LEVEL_8:  The data in Transmit FIFO become <= 8 words
  *   FUART_TX_FIFO_LEVEL_16: The data in Transmit FIFO become <= 16 words
  *   FUART_TX_FIFO_LEVEL_24: The data in Transmit FIFO become <= 24 words
  *   FUART_TX_FIFO_LEVEL_28: The data in Transmit FIFO become <= 28 words
  * @retval None
  */
void FUART_SetINTFIFOLevel(TSB_FUART_TypeDef * FUARTx, uint32_t RxLevel, uint32_t TxLevel)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_RX_FIFO_LEVEL(RxLevel));
    assert_param(IS_FUART_TX_FIFO_LEVEL(TxLevel));

    tmp = RxLevel | TxLevel;

    FUARTx->IFLS = tmp;
}

/**
  * @brief  Mask(Enable) interrupt source of the specified channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  IntMaskSrc: The interrupt source to be masked(enabled).
  * @retval None
  */
void FUART_SetINTMask(TSB_FUART_TypeDef * FUARTx, uint32_t IntMaskSrc)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_INT_MASK_SRC(IntMaskSrc));

    FUARTx->IMSC = IntMaskSrc;
}

/**
  * @brief  Get the mask(enable) setting for each interrupt source.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval A data with union that it indicates the mask setting.
  */
FUART_INTStatus FUART_GetINTMask(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    retval.All = FUARTx->IMSC & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Get the raw interrupt status of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval A data with union that indicates the raw interrupt status.
  */
FUART_INTStatus FUART_GetRawINTStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    retval.All = FUARTx->RIS & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Get the masked interrupt status of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval A data with union that indicates the masked interrupt status.
  */
FUART_INTStatus FUART_GetMaskedINTStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    retval.All = FUARTx->MIS & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Clear the interrupts of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  INTStatus: A data with union that indicates the interrupts to be cleared.
  * @retval None
  */
void FUART_ClearINT(TSB_FUART_TypeDef * FUARTx, FUART_INTStatus INTStatus)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_INT_MASK_SRC(INTStatus.All));

    FUARTx->ICR = INTStatus.All;
}

/**
  * @brief  Enable or disable the DMA receive request output 
  *         on assertion of a UART error interrupt.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  NewState: New state of the DMA receive request output 
  *         on assertion of a UART error interrupt.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetDMAOnErr(TSB_FUART_TypeDef * FUARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* read UARTDMACR then clear bit2 as disable it */
    tmp = FUARTx->DMACR & DMACR_DMAONERR_CLEAR;

    if (NewState == ENABLE) {
        /* if enable, Set bit2: UARTDMACR<DMAONERR> */
        tmp |= DMACR_DMAONERR_SET;
    } else {
        /* Do nothing */
    }

    FUARTx->DMACR = tmp;
}

/**
  * @brief  Enable or Disable the Transmit FIFO DMA or Receive FIFO DMA.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param Direction: The direction of Full UART.
  *   This parameter can be one of the following values:
  *   FUART_RX, FUART_TX
  * @param  NewState: New state of Transmit or Receive FIFO DMA.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetFIFODMA(TSB_FUART_TypeDef * FUARTx, FUART_Direction Direction,
                      FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DIRECTION(Direction));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

