clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_fuart.c
    if (Direction == FUART_TX) {        /* Cofigure Transmit FIFO DMA */
        tmp = FUARTx->DMACR & DMACR_TXDMAE_CLEAR;
        if (NewState == ENABLE) {
            /* if enable, Set bit1: UARTDMACR<TXDMAE> */
            tmp |= DMACR_TXDMAE_SET;
        } else {
            /* Do nothing */
        }
    } else {                    /* Cofigure Receive FIFO DMA */
        tmp = FUARTx->DMACR & DMACR_RXDMAE_CLEAR;
        if (NewState == ENABLE) {
            /* if enable, Set bit0: UARTDMACR<RXDMAE> */
            tmp |= DMACR_RXDMAE_SET;
        } else {
            /* Do nothing */
        }
    }

    FUARTx->DMACR = tmp;
}

/**
  * @brief  Get All the Modem Status, include: CTS, DSR, DCD, RIN, DTR, and RTS.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval A data with union that indicates all the modem status.
  */
FUART_AllModemStatus FUART_GetModemStatus(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmpfr = 0U;
    uint32_t tmpcr = 0U;
    FUART_AllModemStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    tmpfr = FUARTx->FR & FR_MODEM_STATUS_MASK;  /* Get RI, DCD, DSR, CTS status */
    tmpcr = FUARTx->CR & CR_MODEM_STATUS_MASK;  /* Get RTS,DTS status */

    tmpfr |= tmpcr;
    retval.All = tmpfr;
    return retval;
}

/**
  * @brief  Set the Full UART RTS(Request To Send) modem status output.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Status: RTS modem status output.
  *   This parameter can be one of the following values:
  *   FUART_MODEM_STATUS_0: The modem status output is 0
  *   FUART_MODEM_STATUS_1: The modem status output is 1
  * @retval None
  */
void FUART_SetRTSStatus(TSB_FUART_TypeDef * FUARTx, FUART_ModemStatus Status)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_MODEM_STATUS(Status));

    if (Status == FUART_MODEM_STATUS_1) {
        /* Set UARTxCR<RTS> to make RTS modem status output be 1 */
        FUARTx->CR &= CR_RTS_OUTPUT_1;
    } else {
        /* Set UARTxCR<RTS> to make RTS modem status output be 0 */
        tmp = FUARTx->CR | CR_RTS_OUTPUT_0;
        tmp &= CR_WRITE0_BIT_MASK;
        FUARTx->CR = tmp;
    }
}

/**
  * @brief  Set the Full UART DTR(Data Transmit Ready) modem status output.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Status: DTR modem status output.
  *   This parameter can be one of the following values:
  *   FUART_MODEM_STATUS_0: The modem status output is 0
  *   FUART_MODEM_STATUS_1: The modem status output is 1
  * @retval None
  */
void FUART_SetDTRStatus(TSB_FUART_TypeDef * FUARTx, FUART_ModemStatus Status)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_MODEM_STATUS(Status));

    if (Status == FUART_MODEM_STATUS_1) {
        /* Set UARTxCR<DTR> to make DTR modem status output be 1 */
        FUARTx->CR &= CR_DTR_OUTPUT_1;
    } else {
        /* Set UARTxCR<DTR> to make DTR modem status output be 0 */
        tmp = FUARTx->CR | CR_DTR_OUTPUT_0;
        tmp &= CR_WRITE0_BIT_MASK;
        FUARTx->CR = tmp;
    }
}

/** @} */
/* End of group FUART_Exported_Functions */

/** @} */
/* End of group FUART */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM36B_FUART_H) */
